Type id of the second assembly member
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public ElementId TypeId2 { get; }
  Visual Basic
Public ReadOnly Property TypeId2 As ElementId
	Get
  Visual C++
public:
property ElementId^ TypeId2 {
	ElementId^ get ();
}
 See Also
  AssemblyMemberDifferentType Class
  Autodesk.Revit.DB Namespace